Revit 2024 API
BuiltInFailures.ViewFailures.InsertComponentViewFailure Property
 This type of Component cannot be placed in Elevation or Section view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InsertComponentViewFailure { get; }
Visual Basic
Public Shared ReadOnly Property InsertComponentViewFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InsertComponentViewFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace